src/InformationRegisters/ОсновныеПроектыДляУчетаЗатрат/ОсновныеПроектыДляУчетаЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеПроектыДляУчетаЗатрат</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ХарактерЗатрат/ХарактерЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>БракВПроизводстве</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВложенияВоВнеоборотныеАктивы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыНаСбыт</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОбщепроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АдминистративныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВУправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>ТранспортноЗаготовительныеРасходы</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/ОсновныеПроектыДляУчетаЗатрат/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
	Для каждого Запись из ЭтотОбъект цикл
		ХарактерЗатрат = Запись.СтатьяЗатрат.ХарактерЗатрат;
		Если ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве ИЛИ
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			Сообщить("Для статьи затрат с характером затрат '"+ХарактерЗатрат+"' нельзя назначать основной проект для учета затрат",СтатусСообщения.Важное);
			Отказ = истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
